# -*- coding: utf-8 -*-"
#+STARTUP: overview indent

#+TITLE: Avaliação

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 9.0.1)
#+LATEX_HEADER:
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export
#+TAGS: noexport(n) deprecated(d)

Aguarde.

*** E2
Uma solução possível
#+begin_src C :results output :session :exports both
int fun (char *s, char c) {
  if (*s == '\0') {
    // Este é o critério de parada
    return 0;
  }else if (*s == c) {
    return 1 + fun(s+1, c);
  }else{
    return 0 + fun(s+1, c);
  }
}
int main() {
  char str[] = "A expansão acelerada do universo.";
  char c = 'e';
  int resposta = fun(str, c);
  printf("%d\n", resposta);
  return 0;
}
#+end_src

#+RESULTS:
: 4
*** E3
Uma solução possível
#+begin_src C :results output :session :exports both
typedef struct{
  float r;  // parte real
  float i;  // parte imaginária
}complex_t;

void soma1(complex_t *c1, complex_t c2) {
  c1->r = c1->r + c2.r;
  c1->i = c1->i + c2.i;
}

complex_t soma2(complex_t c1, complex_t c2) {
  complex_t ret;
  ret.r = c1.r + c2.r;
  ret.i = c1.i + c2.i;
  return ret;
}

complex_t *soma3(complex_t c1, complex_t c2, complex_t *res) {
  res->r = c1.r + c2.r;
  res->i = c1.i + c2.i;
  return res;
}

void imprime(complex_t c) {
  printf("[%.2f,%.2f]\n", c.r, c.i);
}

int main() {
  complex_t co1 = {2.3, 3.4};
  complex_t co2 = {4.3, 5.4};
  complex_t co3;
  complex_t *co4;
  imprime(co1);
  imprime(co2);
  soma1(&co1, co2);
  imprime(co1);
  co3 = soma2(co1, co2);
  imprime(co3);
  co4 = soma3(co3, co1, &co3);
  imprime(*co4);
  return 0;
}
#+end_src

#+RESULTS:
: [2.30,3.40]
: [4.30,5.40]
: [6.60,8.80]
: [10.90,14.20]
: [17.50,23.00]

